       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. V V BERALDO.
       DATE-WRITTEN. 04/02/2023.
       PROCEDURE DIVISION.
           DISPLAY 'Hello World em cobol!'.
           STOP RUN.
