       >>SOURCE FORMAT FREE
       IDENTIFICATION DIVISION.
           PROGRAM-ID. paragraphs.
           AUTHOR. vvberaldo.
           DATE-WRITTEN. 14/02/2023.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           
       PROCEDURE DIVISION.

       STOP RUN.
